drop-profile-base/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| ========= |                                                                 |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox                         |
| \\ / O peration | Version: v2406                                            |
| \\ / A nd | Website: www.openfoam.com                                       |
| \\/ M anipulation |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

// Domain sized based on drop profile dimensions:
// width: 0.0238 m, height: 0.3 m, length: 0.0238 m
vertices
(
    // Creating a domain with adequate space around the drop profile
    // Upstream: 5x length, Downstream: 10x length, Sides: 5x width, Top/Bottom: 3x height
    (-0.119 -0.119 -0.9) // 0: upstream bottom left
    ( 0.238 -0.119 -0.9) // 1: downstream bottom left
    ( 0.238  0.119 -0.9) // 2: downstream bottom right
    (-0.119  0.119 -0.9) // 3: upstream bottom right
    (-0.119 -0.119  0.9) // 4: upstream top left
    ( 0.238 -0.119  0.9) // 5: downstream top left
    ( 0.238  0.119  0.9) // 6: downstream top right
    (-0.119  0.119  0.9) // 7: upstream top right
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 40)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //